Revit 2024 API
ParameterFilterRuleFactory.CreateBeginsWithRule Method
Overload List
Name | Description
CreateBeginsWithRule(ElementId, String)
 Creates a filter rule that determines whether strings from the document begin with a certain string value.
CreateBeginsWithRule(ElementId, String, Boolean) |  Obsolete.
 Creates a filter rule that determines whether strings from the document begin with a certain string value.
See Also
ParameterFilterRuleFactory Class
ParameterFilterRuleFactory Members
Autodesk.Revit.DB Namespace